perf_output/before/memcached-1.5.20/16/memcached-1.5.20_workloadd_16_run.txt
[WARN]  Running against a source checkout. In order to get our runtime dependencies we'll have to invoke Maven. Depending on the state of your system, this may take ~30-45 seconds
[DEBUG]  Running 'mvn -pl site.ycsb:memcached-binding -am package -DskipTests dependency:build-classpath -DincludeScope=compile -Dmdep.outputFilterFile=true'
WARNING: An illegal reflective access operation has occurred
WARNING: Illegal reflective access by com.google.inject.internal.cglib.core.$ReflectUtils$1 (file:/usr/share/maven/lib/guice.jar) to method java.lang.ClassLoader.defineClass(java.lang.String,byte[],int,int,java.security.ProtectionDomain)
WARNING: Please consider reporting this to the maintainers of com.google.inject.internal.cglib.core.$ReflectUtils$1
WARNING: Use --illegal-access=warn to enable warnings of further illegal reflective access operations
WARNING: All illegal access operations will be denied in a future release
java -cp /proj/proxyweb-PG0/adona/YCSB/memcached/conf:/proj/proxyweb-PG0/adona/YCSB/memcached/target/memcached-binding-0.18.0-SNAPSHOT.jar:/root/.m2/repository/org/apache/htrace/htrace-core4/4.1.0-incubating/htrace-core4-4.1.0-incubating.jar:/root/.m2/repository/org/hdrhistogram/HdrHistogram/2.1.4/HdrHistogram-2.1.4.jar:/root/.m2/repository/log4j/log4j/1.2.17/log4j-1.2.17.jar:/root/.m2/repository/org/codehaus/jackson/jackson-mapper-asl/1.9.13/jackson-mapper-asl-1.9.13.jar:/root/.m2/repository/net/spy/spymemcached/2.11.4/spymemcached-2.11.4.jar:/root/.m2/repository/org/codehaus/jackson/jackson-core-asl/1.9.4/jackson-core-asl-1.9.4.jar:/proj/proxyweb-PG0/adona/YCSB/core/target/core-0.18.0-SNAPSHOT.jar site.ycsb.Client -db site.ycsb.db.MemcachedClient -threads 16 -s -P workloads/workloadd -p memcached.hosts=localhost:11211 -t
Command line: -db site.ycsb.db.MemcachedClient -threads 16 -s -P workloads/workloadd -p memcached.hosts=localhost:11211 -t
YCSB Client 0.18.0-SNAPSHOT

Loading workload...
log4j:WARN No appenders could be found for logger (org.apache.htrace.core.Tracer).
log4j:WARN Please initialize the log4j system properly.
log4j:WARN See http://logging.apache.org/log4j/1.2/faq.html#noconfig for more info.
Starting test.
2021-08-11 17:33:46:594 0 sec: 0 operations; est completion in 0 second 
2021-08-11 17:33:46.706 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:33:46.706 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:33:46.706 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
[...]
2021-08-11 17:33:46.708 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:33:46.709 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:33:46.710 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2021-08-11 17:33:46.711 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:33:46.711 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:33:46.712 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:33:46.714 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:33:46.714 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:33:46.715 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:33:46.715 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:33:46.716 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:33:46.854 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:33:46.854 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:33:46.854 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
[...]
2021-08-11 17:33:46.858 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:33:46.858 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:33:46.855 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:33:46.860 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:33:46.861 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:33:46.862 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:33:46.863 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:33:46.863 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:33:46.864 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:33:46.866 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:33:46.866 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:33:46.867 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:33:46:867 0 sec: 1000 operations; 3649.64 current ops/sec; [READ: Count=950, Max=36383, Min=427, Avg=1717.5, 90=2175, 99=33503, 99.9=36287, 99.99=36383] [CLEANUP: Count=16, Max=12479, Min=1864, Avg=7385.62, 90=10719, 99=12479, 99.9=12479, 99.99=12479] [INSERT: Count=50, Max=63903, Min=772, Avg=4465.44, 90=2487, 99=63903, 99.9=63903, 99.99=63903] 
[OVERALL], RunTime(ms), 273
[OVERALL], Throughput(ops/sec), 3663.003663003663
[TOTAL_GCS_G1_Young_Generation], Count, 0
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 950
[READ], AverageLatency(us), 1717.503157894737
[READ], MinLatency(us), 427
[READ], MaxLatency(us), 36383
[READ], 95thPercentileLatency(us), 2857
[READ], 99thPercentileLatency(us), 33503
[READ], Return=OK, 950
[CLEANUP], Operations, 16
[CLEANUP], AverageLatency(us), 7385.625
[CLEANUP], MinLatency(us), 1864
[CLEANUP], MaxLatency(us), 12479
[CLEANUP], 95thPercentileLatency(us), 11879
[CLEANUP], 99thPercentileLatency(us), 12479
[INSERT], Operations, 50
[INSERT], AverageLatency(us), 4465.44
[INSERT], MinLatency(us), 772
[INSERT], MaxLatency(us), 63903
[INSERT], 95thPercentileLatency(us), 11487
[INSERT], 99thPercentileLatency(us), 63903
[INSERT], Return=OK, 50

 Performance counter stats for 'system wide':

       71843666922      cycles                                                        (66.65%)
       14388648294      branches                                                      (66.67%)
         540601282      branch-misses             #    3.76% of all branches          (66.69%)
       14339561024      branch-loads                                                  (66.70%)
         535705558      branch-load-misses                                            (66.67%)
         655983022      L1-icache-load-misses                                         (66.64%)

      12.206123392 seconds time elapsed